www/python.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>python</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="python"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-31 00:34:27 CST"/>
<meta name="author" content="dirtysalt"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">python</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 python</a>
<ul>
<li><a href="#sec-1-1">1.1 encode/decode</a></li>
<li><a href="#sec-1-2">1.2 wsgi</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> python</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> encode/decode</h3>
<div class="outline-text-3" id="text-1-1">

<p>python字符串是unicode类型，二进制是str类型。
</p><ul>
<li>encode是将unicode转换成为str
</li>
<li>decode是将str转换成为unicode
</li>
</ul>




<pre class="example">&gt;&gt;&gt; a="中国"
&gt;&gt;&gt; a
'\xe4\xb8\xad\xe5\x9b\xbd'
&gt;&gt;&gt; a.decode('utf8')
u'\u4e2d\u56fd'
&gt;&gt;&gt; print a.decode('utf8')
中国
&gt;&gt;&gt; print a.decode('gb18030')
涓浗
</pre>


<p>
这里一个比较难处理的问题就是字符编码的识别，这个在我的项目<a href="./dsgm.html">dsgm</a> 遇到过。个人现在处理的办法就是尝试全部转换成为utf8来进行处理。实现办法就是首先尝试转换
到gb18030,如果转换失败的话那么转换成为utf8（当然这不是最好的，使用chardet这样的模块似乎是更合理的选择），这样的操作对于我们中国大陆用户来说基本上应该
OK，就我所知道的系统XP都是GB2312编码，linux/mac通常设置成为utf8，而cygwin这样架在windows上面的系统通常也是gb2312。
</p>



<pre class="src src-Python">def toUTF8(s):
    try:
        # detect gb2312 first.
        return s.decode('gb2312').encode('utf8')
    except UnicodeDecodeError,e:
        return s

def toLocal(s):
    try:
        open(s,'r') # what a tricky way.
        return s
    except IOError,e:
        if(e.errno==22): # errno.EINVAL
            return s.decode('utf8').encode('gb2312')
        return s
</pre>

<p>
对于从本地转换出去的话，我们首先尝试使用gb2312进行decode，如果失败的话那么就认为是utf8编码，当然这里会有一定的错误机率（但是不大）。
转换到本地的话，我们唯一不确定的就是本地是utf8格式还是gb2312格式。可以通过尝试打开一个文件来判断，其中22是errno.EINVAL的错误编码。
如果字符编码错误的话，那么返回的就是invalid argument的错误，同样会存在一定错误机率（但是不大）。出现错误几率的原因就是这些码点，使用
gb2312可以正常解释，使用utf8也可以正常解释。
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> wsgi</h3>
<div class="outline-text-3" id="text-1-2">

<p>wsgi(web server gateway interface)定义了一个webserver的标准编程接口，对于coder来说只需要实现这个接口，然后可以选择外部其他的framework（比如gunicore），就可以将webserver运行起来了。下面是一个参考代码
</p>


<pre class="src src-Python">def logic(environ,start_response):    
    start_response('200 OK', # status code
                   [('Content-type','text/plain')]) # header
    return (<span style="color: #ffff00;">"OK"</span>,)
</pre>

<p>
对于logic需要处理两个参数：
</p><ul>
<li>environ 表示环境变量，对于get/post请求数据都会放在这里.下面是常用的环境
<ul>
<li>PATH_INFO // 请求path
</li>
<li>REQUEST_METHOD // 请求方法 GET/POST
</li>
<li>CONTENT_LENGTH // 
</li>
<li>QUERY_STRING // path后面接的query，可以使用cgi.parse_qs来进行解析
<ul>
<li>cgi.parse_qs解析后的结果就是dict
</li>
<li>如果dict同一个key出现多次的话会以数组方式保留
</li>
</ul>

</li>
<li>wsgi.input // 可以读取POST数据
</li>
</ul>

</li>
<li>start_response 表示一个continuation，恢复status code以及header
</li>
</ul>


<p>
之后我们只需要选择一个合适的框架就可以运行起来了。python内置了一个wsgi framework。这里的validator可以帮助外围做一些验证。
</p>


<pre class="src src-Python">def run():
    vlogic=validator(logic)
    httpd = make_server('', 8000, vlogic)
    httpd.serve_forever()
</pre>


<p>
内置framework使用的是单进程启动模式，但是我们也可以很容易地修改成为多进程模式。不过更好的方式就是利用已有的webserver framework比如gunicore。假设上面的文件为x.py,那么使用下面方式启动即可
</p>


<pre class="example">[dirlt@compaq-pc] &gt; gunicorn -w 4 x:logic
2012-08-30 23:18:59 [16116] [INFO] Starting gunicorn 0.13.4
2012-08-30 23:18:59 [16116] [INFO] Listening at: http://127.0.0.1:8000 (16116)
2012-08-30 23:18:59 [16116] [INFO] Using worker: sync
2012-08-30 23:18:59 [16119] [INFO] Booting worker with pid: 16119
2012-08-30 23:18:59 [16120] [INFO] Booting worker with pid: 16120
2012-08-30 23:18:59 [16122] [INFO] Booting worker with pid: 16122
2012-08-30 23:18:59 [16121] [INFO] Booting worker with pid: 16121
^C2012-08-30 23:19:09 [16120] [INFO] Worker exiting (pid: 16120)
2012-08-30 23:19:09 [16116] [INFO] Handling signal: int
2012-08-30 23:19:09 [16119] [INFO] Worker exiting (pid: 16119)
2012-08-30 23:19:09 [16122] [INFO] Worker exiting (pid: 16122)
2012-08-30 23:19:09 [16121] [INFO] Worker exiting (pid: 16121)
2012-08-30 23:19:09 [16116] [INFO] Shutting down: Master
</pre>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-31 00:34:27 CST</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
<html><body>
<script type="text/javascript">
var _bdhmProtocol = (("https:" == document.location.protocol) ? " https://" : " http://");
document.write(unescape("%3Cscript src='" + _bdhmProtocol + "hm.baidu.com/h.js%3F54a700ad7035f6e485eaf2300641e7e9' type='text/javascript'%3E%3C/script%3E"));
</script></body></html>